{"03/22/2020": {}, "03/23/2020": {}, "03/24/2020": {}, "03/25/2020": {}, "03/26/2020": {}, "03/27/2020": {}, "03/28/2020": {}, "03/29/2020": {}, "03/30/2020": {}, "03/31/2020": {}, "04/01/2020": {"synonyms": "Jiayin", "pos": 0.09, "neg": 0.02, "neu": 0.8905000000000001, "com": 0.9281999999999999, "raw text": ["SHANGHAI, April  01, 2020  (GLOBE NEWSWIRE) -- Jiayin Group Inc. (“Jiayin” or the “Company”) (NASDAQ: JFIN), a leading online individual finance marketplace in China, today announced its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2019.SHANGHAI, April  01, 2020  (GLOBE NEWSWIRE) -- Jiayin Group Inc. (“Jiayin” or the “Company”) (NASDAQ: JFIN), a leading online individual finance marketplace in China, today announced its unaudited financial results for the fourth quarter and fiscal year ended December 31, 2019.A live and archived webcast of the conference call will be available on the company’s investors relations website at http://ir.jiayin-fintech.com/.About Jiayin Group Inc.Jiayin Group Inc. is a leading online individual finance marketplace in China committed to facilitating effective, transparent, secure and fast connections between investors and borrowers, whose needs are underserved by traditional financial institutions. The origin of the business of the Company can be traced back to 2011. The Company operates a highly secure and open platform with a comprehensive risk management system and a proprietary and effective risk assessment model which employs advanced big data analytics and sophisticated algorithms to accurately assess the risk profiles of potential borrowers.Jiayin GroupMs. Shelley BaiEmail: ir@niwodai.comJiayin Group Inc.", "Jiayin Group Inc. (NASDAQ:JFIN)Q4 2019 Earnings CallApr 1, 2020, 8:00 a.m. ETJiayin Group Inc. (NASDAQ:JFIN)Q4 2019 Earnings CallApr 1, 2020, 8:00 a.m. ETGood day, ladies and gentlemen, and thank you for standing by and welcome to the Jiayin Group Fourth Quarter 2019 Earnings Conference Call. And at this time, all participants are in listen-only mode. Later, we'll conduct a question-and-answer session and instructions will follow at that time. As a reminder, we are recording today's call. And if you have any objection, you may disconnect at this time.Hello everyone. Thank you all for joining us on today's conference call to discuss Jiayin Group's financial results for the fourth quarter and the full year of 2019. We released the result early today. The press release is available on the Company's website as well as from Newswire Services. On the call with me today are Mr. Yan Dinggui, Chief Executive Officer; Mr. Fan Chunlin, Chief Financial Officer; and Mr. Xu Yifang, Chief Risk Officer.Excellent. Last question if I may. In your prepared remarks, you mentioned multiple international geographies, including countries like the Philippines and South America. Can you maybe frame out for us what the status is of those markets for Jiayin Group? Do you expect a material contribution from any of those markets in 2020? How rapidly do you see them growing for you over the next couple of years?More JFIN analysis"], "sample size": 4, "page count": 10}, "04/02/2020": {}, "04/03/2020": {}, "04/04/2020": {}, "04/05/2020": {"synonyms": "Jiayin", "pos": 0.052, "neg": 0.052, "neu": 0.896, "com": 0.1045, "raw text": ["It's been a mediocre week for Jiayin Group Inc. (NASDAQ:JFIN) shareholders, with the stock dropping 14% to US$2.30 in the week since its latest third-quarter results. It was a negative result overall, with revenues coming in 15% less than what the analyst expected, at CN¥511m. This is an important time for investors, as they can track a company's performance in its report, look at what expert is forecasting for next year, and see if there has been any change to expectations for the business. We've gathered the most recent statutory forecasts to see whether the analyst has changed their earnings models, following these results.It's been a mediocre week for Jiayin Group Inc. (NASDAQ:JFIN) shareholders, with the stock dropping 14% to US$2.30 in the week since its latest third-quarter results. It was a negative result overall, with revenues coming in 15% less than what the analyst expected, at CN¥511m. This is an important time for investors, as they can track a company's performance in its report, look at what expert is forecasting for next year, and see if there has been any change to expectations for the business. We've gathered the most recent statutory forecasts to see whether the analyst has changed their earnings models, following these results. View our latest analysis for Jiayin Group  View our latest analysis for Jiayin Group After the latest results, the consensus from Jiayin Group's solitary analyst is for revenues of CN¥1.67b in 2020, which would reflect a painful 25% decline in sales compared to the last year of performance. Prior to the latest earnings, the analyst was forecasting revenues of CN¥2.34b in 2020, and did not provide an earnings per share estimate. The consensus view seems to have become more pessimistic on Jiayin Group, noting the pretty serious reduction to revenue estimates following last week's results.Intriguingly,the analyst has cut their price target 80% to US$2.40 showing a clear decline in sentiment around Jiayin Group's valuation.Looking at the bigger picture now, one of the ways we can make sense of these forecasts is to see how they measure up against both past performance and industry growth estimates. We would highlight that sales are expected to reverse, with the forecast 25% revenue decline a notable change from historical growth of 23% over the last three years. By contrast, our data suggests that other companies (with analyst coverage) in the same industry are forecast to see their revenue grow 9.6% annually for the foreseeable future. So although its revenues are forecast to shrink, this cloud does not come with a silver lining - Jiayin Group is expected to lag the wider industry.One Jiayin Group broker/analyst has provided estimates out to 2020, which can be seen for free  on our platform here.One Jiayin Group broker/analyst has provided estimates out to 2020, which can be seen for free  on our platform here.You should always think about risks though. Case in point, we've spotted   1 warning sign for Jiayin Group  you should be aware of.You should always think about risks though. Case in point, we've spotted   1 warning sign for Jiayin Group  you should be aware of.If you spot an error that warrants correction, please contact the editor at editorial-team@simplywallst.com. This article by Simply Wall St is general in nature. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. Simply Wall St has no position in the stocks mentioned.We aim to bring you long-term focused research analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Thank you for reading.Jiayin Group Inc."], "sample size": 3, "page count": 10}, "04/06/2020": {"synonyms": "Jiayin", "pos": 0.0, "neg": 0.086, "neu": 0.914, "com": -0.5267, "raw text": ["Losers: Zoom Video Communications (NASDAQ:ZM) -8%. Jiayin Group (NASDAQ:JFIN) -7%. Gogo (NASDAQ:GOGO) -7%. Fang (NYSE:SFUN) -6%. Lizhi (NASDAQ:LIZI) -6%.Losers: Zoom Video Communications (NASDAQ:ZM) -8%. Jiayin Group (NASDAQ:JFIN) -7%. Gogo (NASDAQ:GOGO) -7%. Fang (NYSE:SFUN) -6%. Lizhi (NASDAQ:LIZI) -6%."], "sample size": 2, "page count": 10}, "04/07/2020": {}, "04/08/2020": {}, "04/09/2020": {}, "04/10/2020": {}, "04/11/2020": {}, "04/12/2020": {}, "04/13/2020": {}}